import React from "react";

const Hackathon: React.FC = () => {
  return (
    <div>
      <p>
        분산형 식별자(DID), 검증 가능한 자격 증명(VC) 및 스마트 계약(SC)의
        최첨단 트리오를 활용 판매자(예: 상점 주인), 선물 제공자(선물을
        구매하려는 개인), 선물 받는 사람(선물 수령인)의 세 가지 주요 역할 간에
        신뢰 할 수 있고 원활한 선물 교환을 하도록 설계. 백엔드 서버를 중심으로
        사용하여 판매자가 발행한 검증 가능한 선물 자격 증명이 선물을 받은
        사람에게 전달되며, 그 후 자 격 증명이 청구되면 선물을 받은 사람의
        MetaMask Snap에 저장됩니다. 선물을 준 사람과 선물을 받은 사람 모두를
        보호하도록 설계된 에스크로 스마트 계약을 사용하는 것입니다
      </p>
    </div>
  );
};

export default Hackathon;
